[
  {
    "Product_Name": "Almacam Cut",
    "page_url": "/Product/Almacam Cut",
    "imgurl": "https://i.postimg.cc/brFvcgQg/almacam-cut-screenshot-plain.jpg",
    "Product_Hero_Image": "/Images/logo-almacam-cut.png",
    "Technology": "2D",
    "Heading": "Empower Your 2D Cutting Machines with Intelligent Nesting Software",
    "Product_Description": [
      "Almacam Cut offers cutting-edge nesting algorithms to minimize material waste. It operates automatically but allows user intervention for precise programming. Supporting various machine types, it handles everything from part preparation to NC code generation with ease, making it the ultimate CAD/CAM solution for efficient cutting."
    ],
    "VideoUrl": "https://www.youtube.com/watch?v=99BwD1vw1VI&embeds_referring_euri=https%3A%2F%2Falmacam.com%2F&source_ve_path=Mjg2NjY&feature=emb_logo",
    "About_Product": [
      "Universal Machine Compatibility: Seamlessly integrates with any machine type or brand, catering to diverse cutting technologies such as laser, plasma, oxygen cutting, and water jet.",
      "Advanced Nesting Algorithms: Employs powerful algorithms to optimize nesting, minimizing material waste, and ensuring efficient tool path planning.",
      "Intelligent Automation: Offers automatic user assistance throughout the programming process, facilitating ease of use. Can also operate in full automatic mode for streamlined efficiency.",
      "Secure Data Management: Provides secure management of the programming process with complete traceability of data, ensuring confidentiality and integrity.",
      "Interoperability: Enables seamless interaction with various 2D/3D CAD systems and Production Management Systems or ERP solutions, ensuring compatibility and interoperability within existing workflows.",
      "Comprehensive Feature Set: Includes numerous associated modules such as 3D import and unfolding of sheet metal parts, automatic assembly import for quotes or manufacturing, libraries of shapes for various applications like boiler-making and cutting of letters and drawings. Additionally, it offers functionalities for quote calculation, inventory management, manufacturing orders, workshop station management, and scheduling, among others."
    ],
    "Machine_Brands": [
      "Laser Machine",
      "Plasma machine",
      "Waterjet machine",
      "Oxycutting machine"
    ],
    "get": "Almacam Cut offers robust and secure data management, ensuring traceability in a collaborative setting. Embracing the principles of Industry 4.0, Almacam seamlessly integrates with the company's information system, facilitating effortless connections with Production Management and ERP software. With Almacam, access workshop management tools and a comprehensive production statistics module, fostering seamless integration within the digital sequence of ERP, Production Management, and Workshop operations.",
    "Documents": [
      {"name":"Download Almacam Cut’s product flyer for laser cutting","url":"https://drive.google.com/file/d/1_JAuzd1dCf57xgPPunFQ-rhNzmD1-4eT/view?usp=drive_link"},
      {"name":"Download Almacam Cut’s product flyer for oxy-cutting and plasma cutting","url":"https://drive.google.com/file/d/1S0dKe2a5AMR56TLqx1yw-xTZt37b24rO/view?usp=drive_link"},
      {"name":"Download Almacam Cut’s product flyer for waterjet cutting","url":"https://drive.google.com/file/d/1KgYGYvThcoJ1Q5n0aj0i7mbTulR3myr-/view?usp=drive_link"}
    ],
    "Video_links": [
      {
        "title": "Almacam nesting optimization",
        "url": "https://www.youtube.com/watch?v=xRMTBYFR1LU"
      },
      {
        "title": "Importing a multi-DXF file with Almacam",
        "url": "https://www.youtube.com/watch?v=yK39kbotYnU"
      },
      {
        "title": "Chamfer/Bevel programming with Almacam",
        "url": "https://www.youtube.com/watch?v=rbsrwTjXLMA"
      }
    ]
  },
  {
    "Product_Name": "Almacam Punch",
    "page_url": "/Product/Almacam Punch",
    "imgurl": "https://i.postimg.cc/JnxnKM09/almacam-punch-screenshot.jpg",
    "Product_Hero_Image": "/Images/logo-almacam-punch.png",
    "Technology": "2D",
    "Heading": "A highly efficient CAD/CAM software tailored for the dynamic production of a multitude of parts, necessitating punching and nibbling processes on demand.",
    "Product_Description": [
      "Almacam Punch excels with its powerful automation features, covering tool allocation, machining sequence, nesting, part evacuation, and beyond.",
      "Almacam Punch's nesting module optimizes material usage, adapting seamlessly to punching constraints. It efficiently manages loading/unloading peripherals and integrates seamlessly with other Almacam products for control over combined machines"
     
    ],
    "VideoUrl": "https://www.youtube.com/watch?v=qbZ1_U4x03o",
    "About_Product": [
      "Automatic machining: tool allocation, nesting, optimized machining sequences, including part evacuation and NC program generation.",
      "Common cutting of identical or non-identical parts with various tools",
      "Automatic preparation of parts in \"micro-junction\" mode.",
      "Automatic nesting around or under clamps.",
      "Management of multi-tools, special, and deformation tools.",
      "Automatic or manual handling of any evacuation system.",
      "Part machining preparation based on pre-defined turret models.",
       "Almacam Punch seamlessly supports diverse machine and technology needs from part preparation to NC code generation. It ensures secure data management, integrates with Industry 4.0 principles, connects with Production Management and ERP software, and offers workshop management tools with production statistics."
    ],
    "Machine_Brands": [
      "Amada",
      "Baykal",
      "Behrens",
      "Boschert",
      "Dalcos",
      "Danobat Sheet Metal",
      "Dimeco",
      "Durma",
      "Ermaksan",
      "Euromac",
      "Finn Power",
      "FPL",
      "Goiti",
      "Jin Fang Yuan",
      "Jinan Kaifeng Cnc Machinery Co. Ltd",
      "Lag Rainer",
      "LVD Strippit",
      "Murata",
      "Prima-Power",
      "Produtech",
      "Pullmax",
      "Rainer",
      "Raskin",
      "Strippit",
      "Trumpf",
      "Wiedemann"
    ],
    "Documents": [
      {"name":"Download Almacam Punch’s product flyer","url":"https://drive.google.com/file/d/18w8Eo2RInVtczyW4QkPjxr9eWLB6RCRz/view?usp=drive_link"}
    ],
    "Video_links": [
      {
        "title": "Overview of Almacam Punch",
        "url": "https://www.youtube.com/watch?v=qbZ1_U4x03o"
      }
    ]
  },
  {
    "Product_Name": "Almacam Routing",
    "page_url": "/Product/Almacam Routing",
    "imgurl": "https://i.postimg.cc/br6ZYpjQ/almacam-routing-screenshot-plain.jpg",
    "Product_Hero_Image": "/Images/logo-almacam-routing.png",
    "Technology": "2D",
    "Heading": "Efficient Nesting Software for Routing and 2.5 Axis Machining of Aluminum Sheets and Wood Panels",
    "Product_Description": [
      "Alma has cultivated precise expertise in crafting software tailored for routing and 2.5 axis machining across wood, aluminum, and soft materials. The Almacam Routing CAD/CAM software stands as a premium, high-value solution ideal for industrial firms with significant nesting requirements, particularly those engaged in small to medium series production."
    ],
    "About_Product": [
      "Streamlined Wood Part Preparation: Includes geometry recognition and automatic machining assignment directly on 3D CAD/CAM wood parts through the Wood module, saving time during preparation.",
      "Enhanced Efficiency: Offers one-click nesting, machining sequence optimization, and NC program generation with a single mouse click.",
      "Integrated Production Management: Enables combined management of nested part production and complementary machining on individual wood parts.",
      "Versatile Machining Support: Supports various machining types (drilling, grooving, etc.) and all routing machine technological functions.",
      "Seamless Integration: Integrates machine technological capacities once a machining operation is assigned, ensuring seamless operation.",
      "Aluminum Machining Expertise: Manages multi-layer nesting to minimize machining time and automates screwing, riveting operations, and rivet removal on aluminum parts and skeleton.",
      "Aluminum Machining Expertise: Manages multi-layer nesting and automates screwing and riveting operations.",
      "Customizable Strategies: Provides easy configuration and customization capabilities to define automatic machining strategies for wood.",
      "Safety Assurance: Integrates suction constraints into automatic nesting algorithms to secure parts during wood machining.",
      "Versatile Wood Panel Machining: Used for 2.5 axis machining of wood panels, suitable for interior design in various sectors such as yachts, caravans, kitchens, etc.",
      "Comprehensive Routing Management: Manages routing of \"top side\" and \"down side\" parts, followed by machining if necessary, for individual wood parts.",
      "Specialized Wood Module: Combines geometry recognition and automatic machining functions, allowing import and automatic preparation of any CAD-designed 3D wood part.",
      "Aluminum Sheet Routing Expertise: Offers high nesting performance and meets all technological requirements and constraints for aluminum routing processes, including multi-layer machining, screwing, riveting, and micro-junctions, with over 25 years of specialization in routing technology for the aeronautics industry."
    ],
    "Machine_Brands": [
      "Biesse",
      "CMS",
      "Creno",
      "Holz-Her",
      "Homag",
      "Kimla",
      "Maka",
      "Mecanumeric",
      "Multicam",
      "OSAI",
      "Protek",
      "Reichenbacher",
      "Stako",
      "Techtronix"
    ]
  },
  {
    "Product_Name": "Almacam Combi",
    "page_url": "/Product/Almacam Combi",
    "imgurl": "https://i.postimg.cc/RCG6LQnN/almacam-combi-screenshot-plain.jpg",
    
    "Product_Hero_Image": "/Images/logo-almacam-combi.png",
    "Technology": "2D",
    "Heading": "Revolutionize Your Combined Laser/Punching or Plasma/Drilling Machines with Advanced Nesting Software",
    "Product_Description": [
      "Almacam Combi CAD/CAM supports all combined laser/punching and plasma/drilling machines, accounting for each technology's specifics in programming.",
      "Its powerful automation (tool allocation, machining sequence, nesting, etc.) boosts productivity for diverse part production needs."
      
    ],
    "About_Product": [
      "Supports all machine types and cutting technologies (laser, plasma) for punching and drilling, regardless of brand.",
      "Efficient tool allocation and management ensure optimal cutting conditions.",
      "Prevents collisions between the cutting head and parts, ensuring safe operation.",
      "Facilitates common cutting of both identical and non-identical parts.",
      "Enables nesting under or around clamps for maximum material usage.",
      "Manages special or deformation tools effectively.",
      "Handles any evacuation system seamlessly.",
      "Employs powerful nesting and optimized tool trajectory algorithms.",
      "Offers automatic user assistance throughout programming, with full automatic mode for NC program generation, nesting, and machining sequence optimization.",
      "Provides secure programming management and complete data traceability.",
      "Interacts seamlessly with various 2D/3D CAD systems and Production Management Systems or ERP solutions.",
      "Includes numerous associated modules for 3D part import, assembly import, quote calculation, inventory and manufacturing order management, workshop station, scheduling, etc.",
    "Exclusive nesting algorithms minimize material waste, enhancing efficiency.",
      "Offers secure, traceable data management, seamlessly integrating with Industry 4.0 principles and production management systems."
    ],
    "Machine_Brands": [
      "Cori",
      "Finn Power",
      "Rainer",
      "Voortman",
      "Dimeco",
      "Kaltenbach",
      "Trumpf",
      "Whitney",
      "Ficep",
      "Peddinghaus",
      "Vernet Behringer"
    ]
  },
  {
    "Product_Name": "Almacam TUBE",
    "page_url": "/Product/Almacam TUBE",
    "imgurl": "https://i.postimg.cc/J44XfdWN/almacam-tube-screenshot-plain.jpg",
    "Product_Hero_Image": "/Images/logo-almacam-tube.png",
    "Technology": "3D",
    "Heading": "The Automated Solution for Programming Tubes and Profiles Cutting Machines and Robots",
    "Product_Description": [
      "Almacam Tube CAD/CAM interacts with various tube and profile cutting systems (3, 4, or 5 axis machines, robotic cells).",
      "Integrates all programming steps: CAD import, manufacturing order management, automatic nesting, trajectory creation, ISO code generation."
         ],
    "About_Product": [
      "CAD import with quantity retrieval.",
      "Automatic sectional area recognition for tubes and profiles.",
      "Option to add connections between parts.",
      "Automatic unfolding and unbending.",
      "Automated trajectory and program generation for cutting.",
      "Compatible with any type and brand of cutting machine.",
      "Handles specific machine functions and requirements.",
      "Manages machines combining laser cutting with mechanical units. (drilling, countersinking, spot facing, counterboring, etc.)",
      "Combines automation with user control for optimal programming execution.",
      "Draws on Alma's extensive expertise in 3D/Tubes machine programming and cutting robots, gained through installations and partnerships."

    ],
    "VideoUrl": "https://youtu.be/UTHAVYr7uSM",
    "Machine_Brands": [
      "Bodor",
      "Han’S Laser",
      "Sibonac",
      "Bystronic",
      "Huagong",
      "Silber Do Brasil",
      "Trumpf",
      "TTM",
      "Cutlite Penta",
      "Mazak",
      "SLTL",
      "Wardjet",
      "Cy Laser",
      "Müller Opladen",
      "Soitaab",
      "Yawei",
      "Daihen Varstroj",
      "Nukon",
      "Tamari Industry",
      "Debao",
      "OMP",
      "Tecnopampa",
      "Farley",
      "Oxyser",
      "Tecoi"
    ],
    "Documents": [
      {"name":"Download Almacam Tube’s product flyer","url":"https://drive.google.com/file/d/1J5diLrAu3nYhzwWSnqQcrOEobFGXV4oY/view?usp=drive_link"}
    ],
    "Video_links": [
      {
        "title": "Overview of Almacam Tube",
        "url": "https://www.youtube.com/watch?v=7XE9SttF43A"
      },
      {
        "title": "Unfolding/Unbending a solid with Almacam Tube",
        "url": "https://www.youtube.com/watch?v=6jrXK-2iNew"
      },
      {
        "title": "Adding a connection between two tubes of an assembly with Almacam Tube",
        "url": "https://www.youtube.com/watch?v=9IN4sHOrGvM"
      }
    ]
  },
  {
    "Product_Name": "Almacam SPACECUT",
    "page_url": "/Product/Almacam SPACECUT",
    "imgurl": "https://i.postimg.cc/xjmpk8kx/almacam-spacecut-screenshot-plain.jpg",
    "Product_Hero_Image": "/Images/logo-almacam-SpaceCut.png",
    "Technology": "3D",
    "Heading": "Optimize Your 5-Axis Cutting Machines and Robots with CAD/CAM Programming Software",
    "Product_Description": [
      "Almacam Space Cut CAD/CAM software features an intuitive interface, tailored for programming all types of 3D-cutting machines (laser, plasma, water jet) regardless of axis count. It blends automation with user-friendly simplicity, supporting advanced manufacturing functions and accommodating diverse cutting needs for intricate part designs"
    ],
    "About_Product": [
      "Thorough machine and environment modeling.",
      "Streamlined programming with automated trajectory creation, lead-in/out definition, and profile sequencing.",
      "Collision-free trajectory search and rapid movement automation.",
      "Realistic cutting sequence simulation with anomaly visualization.",
      "Automatic tooling modeling for 3D part support based on part model.",
      "User-friendly interface with object display in tree structures, object positioning, and easy trajectory modification.",
      "Expansion to additional processes like laser welding and polishing."
    ],
    "VideoUrl": "https://youtu.be/upOd-Qi0DJM",
    "Machine_Brands": [
      "Adige",
      "Cyberstep",
      "Koike",
      "LT-Free",
      "Lyonstek",
      "Mazak",
      "Mecanumeric",
      "Microstep",
      "Nippei",
      "NTC",
      "Penta-Chutian",
      "Prima",
      "Tamari Industry",
      "TCI",
      "Trumpf",
      "Wardjet",
      "Weihong",
      "Yawei"
    ],
    "Documents": [
      {
        "name": "Download Almacam Space Cut’s product flyer", "url": "https://drive.google.com/file/d/1SYOr_3d4lF0sDl-T7s3tI3GSYrOYvrEu/view?usp=drive_link"
      }
    ],
    "Video_links": [
      {
        "title": "Overview of Almacam Space Cut","url": "https://www.youtube.com/watch?v=upOd-Qi0DJM"
      }
    ]
  },
  {
    "Product_Name": "AlmaQUOTE",
    "page_url": "/Product/AlmaQUOTE",
    "imgurl": "https://i.postimg.cc/1XSGV9T2/Almaquote-2022.jpg",
    "Product_Hero_Image": "/Images/logo-almaquote.png",
    "Technology": "Costing",
    "Heading": "Almaquote: Simplifying and Accelerating Sheet Metal Part Quotation",
    "Product_Description": [
      "Outdated methods of handling sheet metal and mechanical welding quotations are impeding your business growth. Almaquote offers a tailored solution, enabling faster responses and more precise quotations. Easy to navigate, Almaquote empowers sheet metal subcontractors, sales managers, and estimating professionals to generate dependable quotations efficiently, saving valuable time"
    ],
    "About_Product": [
      "Almaquote caters to both basic and complex quoting needs.",
      "Customizable according to specific requirements.",
      "Utilizes Alma's expertise in sheet metal for precise calculations.",
      "Automatic calculation of cutting times and material costs.",
      "Calculation of material costs based on Alma nesting algorithms.",
      "Estimates times for various manufacturing operations.",
      "Offers clear visibility of quote information.",
      "Manages multi-level BOMs and supports reuse of existing ones.",
      "Provides graphical tools for analysis.",
      "Access to Webquote service for streamlined communication.",
      "Direct connection to Assembly2cam CAM assembly importing module.",
      "Seamless integration with CAM, CAD, Production Management, and ERP systems.",
      "Accurate estimates for 2D parts, tubes, and sections.",
      "Highly configurable, allowing customization at various levels.",
      "Integration with CAD-CAM and ERP tools for enhanced workflow.",
      "Immediate production initiation for Almacam users upon quote acceptance.",
      "Almacam software users can swiftly initiate production upon quote acceptance.",
      "Additionally, Almaquote users gain access to Webquote, a new web service that streamlines communication between customers and subcontractors, automating quote preparation and processing."
    ],
    "VideoUrl": "https://youtu.be/LzDUBC6Wq_4",
    "get": "The Almaquote software is available for purchase either as a perpetual license, installable on your computers, or through a flexible, commitment-free subscription with Almacam Pass.",
    "Documents": [
       {"name":"Download Almaquote’s product flyer","url":"https://drive.google.com/file/d/1n5vtc-aKnsW89xeN3Z07VmiH2Vvb7s3a/view?usp=drive_link"}
       
    ],
    "Video_links": [
      {
        "title": "Importing a CAD assembly in a quote",
        "url": "https://www.youtube.com/watch?v=ycBkdZCqv4Q"
      }
    ]
  },
  {
    "Product_Name": "AlmaCAM WELD",
    "page_url": "/Product/AlmaCAM WELD",
    "imgurl": "https://i.postimg.cc/XNgFD6tN/almacam-weld-screenshot-plain.jpg",
    "Product_Hero_Image":"/Images/logo-almacam-weld.png",
    "Technology": "3D",
    "Heading": "Transforming Welding Precision: Unleash the Power of Offline Programming for Arc-Welding Robots",
    "Product_Description": [
      "Almacam Weld specializes in offline programming for arc-welding robots, optimizing robot usage for enhanced flexibility and productivity. With two decades of innovation, it stands as the premier solution in arc-welding robot programming, revolutionizing efficiency and performance"
    ],
    "About_Product": [
      "Almacam Weld surpasses manual teaching methods in programming speed.",
      "Productivity sees a significant boost with reduced idle periods and programming costs.",
      "Immediate programming initiation follows virtual assembly creation.",
      "Collision-free robot trajectories are ensured through automatic detection.",
      "Comprehensive cell simulation guarantees design and production reliability.",
      "Welding quality improves with integrated and repeatable welding parameters.",
      "Programming cycles for similar parts are shortened with automated program transfer.",
      "Trajectory shifts are managed seamlessly via wire and nozzle sensing, joint tracking, and laser camera integration.",
      "Synchronization between multiple robots and positioners is achieved effortlessly.",
      "Enhanced safety and working conditions are realized through a single solution for managing multi-brand robot systems.",
      "Efficiently control multiple robot brands with just one comprehensive solution."
    ],
    "VideoUrl": "https://youtu.be/YmGKq02jiRo",
    "Product overview": [
      "Utilizing a graphical interface, Almacam Weld empowers users to program robots within a virtual environment and simulate their actions. Assemblies and tooling required for welding tasks are seamlessly imported from a 3D CAD system.",
      "Almacam Weld integrates welding expertise with advanced programming and simulation features, delivering a resilient, dependable, and intuitive solution tailored for users."
    ],
    "Machine_Brands": [
      "ABB",
      "IGM",
      "Panasonic",
      "Cloos",
      "Kawasaki",
      "Reis",
      "Fanuc",
      "Kuka",
      "Staubli",
      "Hyundai",
      "OTC Daihen",
      "Yaskawa/Motoman"
    ],
    "Documents": [
      {
        "name":"Download Almacam Weld’s product flyer","url":"https://drive.google.com/file/d/1bSe0O8r12aAAmsfUB7InU6oKuw3NofJh/view?usp=drive_link"
      }
    ],
    "Video_links": [
      {
        "title": "Overview of Almacam Weld",
        "url": "https://www.youtube.com/watch?v=YmGKq02jiRo"
      },
      {
        "title": "Automatic toolpath and robot programming with Almacam Weld",
        "url": "https://www.youtube.com/watch?v=uYCwTHJjEXQ"
      },
      {
        "title": "Intelligent program cloning with Almacam Weld",
        "url": "https://www.youtube.com/watch?v=QujnhLl8maw"
      },
      {
        "title": "Automatic program duplication",
        "url": "https://www.youtube.com/watch?v=TKZEIY0me74"
      },
      {
        "title": "Offline programming software for arc welding robots",
        "url": "https://www.youtube.com/watch?v=CQlrHnOAuzs"
      },
      {
        "title": "Why is off-line programming vital in a robotic welding project?",
        "url": "https://almacam.com/why-is-offline-programming-vital-in-a-robotized-welding-project/"
      },
      {
        "title": "How to successfully program your welding robots off-line",
        "url": "https://almacam.com/how-to-successfully-program-your-welding-robots-off-line/"
      }
    ]
  },
  {
    "Product_Name": "Nest&Cut",
    "Product_Hero_Image": "/Images/nestcut.png",
    "page_url": "/Product/Nest&Cut",
    "imgurl": "https://i.postimg.cc/BvyNbfJf/nestandcut-screenshot-plain.jpg",
    "Technology": "Cloud Application",
    "Heading": "Cloud-Driven Efficiency: Instantly Optimize Nesting Layouts for Any Cutting Machine and Material",
    "Product_Description": [
      "With the Nest&Cut web application, companies worldwide cutting flat materials can now harness advanced automatic nesting algorithms, slashing raw material costs without the need for hefty investments",
      "Simply upload your geometries in DXF format, input relevant data (such as part quantities and material formats), and initiate automatic nesting in the Cloud with just a few clicks. Within moments, Nest&Cut generates optimized cutting drawings in DXF format, complete with part cutting order, seamlessly ready for your cutting software or machine’s numeric control."
    ],
    "About_Product": [
      "Benefit from lightning-fast, high-performance automatic 2D nesting, even for the most complex shapes",
      "Access exclusive functions like automatic cleaning of DXF geometries, re-nesting of existing cutting plans, multi-format nesting, and export of part cutting order.",
      "Enjoy rapid import and cleaning of DXF geometries, with adjustable computation time for optimal material yield.",
      "Experience simplicity at its finest - no training required for our user-friendly interface.",
      "Always stay up-to-date with the latest functionalities as our solution is a 100% web application.",
      "Utilize the tool for both production needs (exporting DXF nestings with part cutting order) and estimating material costs.",
      "Accessible through a straightforward monthly subscription - no upfront investment or financial risk required."
    ],
    "VideoUrl": "https://www.youtube.com/watch?v=sTWCk_2xvGE&t=91s",
    "Product Overview": [
      "Summary:Nest&Cut offers web-based access to powerful automatic nesting functions tailored for intricate 2D parts, enabling efficient cutting across a wide array of flat materials such as sheet metal, wood, textiles, composite, stone, foam, and more.",
      "Target Customers:Ideal for cutting sub-contractors or manufacturers seeking to enhance material yield without the burden of investing in high-performance nesting software. Nest&Cut caters to those looking to optimize material usage on a recurring or occasional basis. It's particularly suited for businesses hesitant to invest in on-premises CAD/CAM software due to factors like high maintenance and acquisition costs, scarcity of human resources, and lengthy training requirements.",
      "Usage:Nest&Cut serves as a valuable tool for accurately estimating material consumption and associated costs. For instance, it can be utilized by ordering parties to assess the quantity of formats required by sub-contractors to fulfill their orders efficiently."
    ]
  }
]